Tekla Open API Reference for Tekla Structures 2025
Model.FetchModelObjects Method
Overload List
Name | Description
FetchModelObjects(List<String>, Boolean)
 Fetches a list of modelobjects based on given guid list of objects, checks if guid is native or external (for reference model object) and optionally selects objects before returning them.
FetchModelObjects(List<Identifier>, Boolean)
 Fetches a list of modelobjects based on given identifier list of objects, and optionally selects objects before returning them.
Top
See Also
Reference
Model Class
Tekla.Structures.Model Namespace